cylinder_re40/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType RAS;

RAS
{
    RASModel    nnMLP;
    turbulence  on;
    printCoeffs on;

    nnMLPCoeffs
    {
        weightsDir  "constant/nn_weights/mlp_paper";
        nutMax      1.0;
    }
}
