cylinder_re40/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }
}
SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    pRefCell 0;
    pRefValue 0;
    residualControl
    {
        p       1e-4;
        U       1e-5;
        "(k|omega)" 1e-5;
    }
}
relaxationFactors
{
    equations { U 0.7; k 0.7; omega 0.7; }
    fields { p 0.3; }
}
